Tinkerforge/esp32-firmware/software/src/tools/tf_websocket_client.c
static int tf_websocket_client_send_with_exact_opcode(tf_websocket_client_handle_t client, ws_transport_opcodes_t opcode, const uint8_t *data, int len, TickType_t timeout)
{
    int ret = -1;
    int need_write = len;
    int wlen = 0, widx = 0;
    bool contained_fin = opcode & WS_TRANSPORT_OPCODES_FIN;

    if (client == NULL || len < 0 || (data == NULL && len > 0)) {
        ESP_LOGE(TAG, "Invalid arguments");
        return -1;
    }

    if (!tf_websocket_client_is_connected(client)) {
        ESP_LOGE(TAG, "Websocket client is not connected");
        return -1;
    }

    if (client->transport == NULL) {
        ESP_LOGE(TAG, "Invalid transport");
        return -1;
    }

#ifdef CONFIG_TF_WS_CLIENT_SEPARATE_TX_LOCK
    if (xSemaphoreTakeRecursive(client->tx_lock, timeout) != pdPASS) {
        ESP_LOGE(TAG, "Could not lock ws-client within %" PRIu32 " timeout", timeout);
        return -1;
    }
#else
    if (xSemaphoreTakeRecursive(client->lock, timeout) != pdPASS) {
        ESP_LOGE(TAG, "Could not lock ws-client within %" PRIu32 " timeout", timeout);
        return -1;
    }
#endif

    if (tf_websocket_new_buf(client, true) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to setup tx buffer");
        goto unlock_and_return;
    }

    while (widx < len || opcode) {  // allow for sending "current_opcode" only message with len==0
        if (need_write > client->buffer_size) {
            need_write = client->buffer_size;
            opcode = opcode & ~WS_TRANSPORT_OPCODES_FIN;
        } else if (contained_fin) {
            opcode = opcode | WS_TRANSPORT_OPCODES_FIN;
        }
        memcpy(client->tx_buffer, data + widx, need_write);
        // send with ws specific way and specific opcode
        wlen = esp_transport_ws_send_raw(client->transport, opcode, (char *)client->tx_buffer, need_write,
                                         (timeout == portMAX_DELAY) ? -1 : timeout * portTICK_PERIOD_MS);
        if (wlen < 0 || (wlen == 0 && need_write != 0)) {
            ret = wlen;
            tf_websocket_free_buf(client, true);

#ifdef CONFIG_TF_WS_CLIENT_SEPARATE_TX_LOCK
            xSemaphoreGiveRecursive(client->tx_lock);
            xSemaphoreTakeRecursive(client->lock, portMAX_DELAY);
#endif
            esp_tls_error_handle_t error_handle = esp_transport_get_error_handle(client->transport);
            if (error_handle) {
                const char *error_name = esp_err_to_name(error_handle->last_error);
                tf_websocket_client_error(client, "esp_transport_write() returned %d, transport_error=%s, tls_error_code=%i, tls_flags=%i, errno=%d",
                                           ret, error_name, error_handle->esp_tls_error_code,
                                           error_handle->esp_tls_flags, errno);
            } else {
                tf_websocket_client_error(client, "esp_transport_write() returned %d, errno=%d", ret, errno);
            }
            ESP_LOGD(TAG, "Calling abort_connection due to send error");
#ifdef CONFIG_TF_WS_CLIENT_SEPARATE_TX_LOCK
            tf_websocket_client_abort_connection(client, WEBSOCKET_ERROR_TYPE_TCP_TRANSPORT);
            xSemaphoreGiveRecursive(client->lock);
            return ret;
#else
            // Already holding client->lock, safe to call
            tf_websocket_client_abort_connection(client, WEBSOCKET_ERROR_TYPE_TCP_TRANSPORT);
            goto unlock_and_return;
#endif
        }
        opcode = 0;
        widx += wlen;
        need_write = len - widx;
    }
    tf_websocket_free_buf(client, true);
    ret = widx;

unlock_and_return:
#ifdef CONFIG_TF_WS_CLIENT_SEPARATE_TX_LOCK
    xSemaphoreGiveRecursive(client->tx_lock);
#else
    xSemaphoreGiveRecursive(client->lock);
#endif
    return ret;
}

tf_websocket_client_handle_t tf_websocket_client_init(const tf_websocket_client_config_t *config)
{
    tf_websocket_client_handle_t client = calloc(1, sizeof(struct tf_websocket_client));
    ESP_WS_CLIENT_MEM_CHECK(TAG, client, return NULL);

    esp_event_loop_args_t event_args = {
        .queue_size = WEBSOCKET_EVENT_QUEUE_SIZE,
        .task_name = NULL // no task will be created
    };

    if (esp_event_loop_create(&event_args, &client->event_handle) != ESP_OK) {
        ESP_LOGE(TAG, "Error create event handler for websocket client");
        free(client);
        return NULL;
    }

    if (config->keep_alive_enable == true) {
        client->keep_alive_cfg.keep_alive_enable = true;
        client->keep_alive_cfg.keep_alive_idle = (config->keep_alive_idle == 0) ? WEBSOCKET_KEEP_ALIVE_IDLE : config->keep_alive_idle;
        client->keep_alive_cfg.keep_alive_interval = (config->keep_alive_interval == 0) ? WEBSOCKET_KEEP_ALIVE_INTERVAL : config->keep_alive_interval;
        client->keep_alive_cfg.keep_alive_count = (config->keep_alive_count == 0) ? WEBSOCKET_KEEP_ALIVE_COUNT : config->keep_alive_count;
    }

    if (config->if_name) {
        client->if_name = calloc(1, sizeof(struct ifreq) + 1);
        ESP_WS_CLIENT_MEM_CHECK(TAG, client->if_name, goto _websocket_init_fail);
        memcpy(client->if_name, config->if_name, sizeof(struct ifreq));
    }

    client->lock = xSemaphoreCreateRecursiveMutex();
    ESP_WS_CLIENT_MEM_CHECK(TAG, client->lock, goto _websocket_init_fail);

#ifdef CONFIG_TF_WS_CLIENT_SEPARATE_TX_LOCK
    client->tx_lock = xSemaphoreCreateRecursiveMutex();
    ESP_WS_CLIENT_MEM_CHECK(TAG, client->tx_lock, goto _websocket_init_fail);
#endif

    client->config = calloc(1, sizeof(websocket_config_storage_t));
    ESP_WS_CLIENT_MEM_CHECK(TAG, client->config, goto _websocket_init_fail);

    if (config->transport == WEBSOCKET_TRANSPORT_OVER_TCP) {
        if (asprintf(&client->config->scheme, WS_OVER_TCP_SCHEME) < 0) {
            client->config->scheme = NULL;
        }
        ESP_WS_CLIENT_MEM_CHECK(TAG, client->config->scheme, goto _websocket_init_fail);
    } else if (config->transport == WEBSOCKET_TRANSPORT_OVER_SSL) {
        if (asprintf(&client->config->scheme, WS_OVER_TLS_SCHEME) < 0) {
            client->config->scheme = NULL;
        }
        ESP_WS_CLIENT_MEM_CHECK(TAG, client->config->scheme, goto _websocket_init_fail);
    }

