Tinkerforge/esp32-firmware/software/src/tools/tf_websocket_client.c
                    tf_websocket_client_set_uri(client, client->config->uri);

                    if (client->config->port == 0) {
                        client->config->port = esp_transport_get_default_port(client->transport);
                    }

                    // Rerun the connection with the redir uri.
                    client->state = WEBSOCKET_STATE_INIT;
                    ESP_LOGI(TAG, "Redirecting to %s", client->config->uri);
                    break;
                }
            }
#endif
            ESP_LOGD(TAG, "Transport connected to %s://%s:%d", client->config->scheme, client->config->host, client->config->port);

            client->state = WEBSOCKET_STATE_CONNECTED;
            client->wait_for_pong_resp = false;
            client->error_handle.error_type = WEBSOCKET_ERROR_TYPE_NONE;
            client->payload_len = 0;
            client->payload_offset = 0;
            client->last_fin = false;
            client->last_opcode = WS_TRANSPORT_OPCODES_NONE;

            tf_websocket_client_dispatch_event(client, WEBSOCKET_EVENT_CONNECTED, NULL, 0);

            // Check if there is data pending to be read (e.g. piggybacked with handshake)
            if (esp_transport_poll_read(client->transport, 0) > 0) {
                esp_err_t recv_result = tf_websocket_client_recv(client);
                if (recv_result == ESP_OK) {
                    xSemaphoreGiveRecursive(client->lock);
                    esp_event_loop_run(client->event_handle, 0);
                    xSemaphoreTakeRecursive(client->lock, portMAX_DELAY);
                    if (client->state != WEBSOCKET_STATE_CONNECTED || client->transport == NULL) {
                        ESP_LOGD(TAG, "Connection state changed during handshake data processing");
                        break;
                    }
                } else if (recv_result == ESP_FAIL) {
                    ESP_LOGE(TAG, "Error receive data during initial connection");
                    tf_websocket_client_abort_connection(client, WEBSOCKET_ERROR_TYPE_TCP_TRANSPORT);
                }
            }
            break;
        case WEBSOCKET_STATE_CONNECTED:
            if ((CLOSE_FRAME_SENT_BIT & xEventGroupGetBits(client->status_bits)) == 0) { // only send and check for PING
                // if closing hasn't been initiated
                if (_tick_get_ms() - client->ping_tick_ms > client->config->ping_interval_sec * 1000) {
                    client->ping_tick_ms = _tick_get_ms();
                    ESP_LOGD(TAG, "Sending PING...");
#ifdef CONFIG_TF_WS_CLIENT_SEPARATE_TX_LOCK
                    // Release client->lock first to avoid deadlock with send error path
                    xSemaphoreGiveRecursive(client->lock);

                    // Now acquire tx_lock with timeout (consistent with PONG handling)
                    if (xSemaphoreTakeRecursive(client->tx_lock, WEBSOCKET_TX_LOCK_TIMEOUT_MS) != pdPASS) {
                        ESP_LOGE(TAG, "Could not lock ws-client within %d timeout for PING", WEBSOCKET_TX_LOCK_TIMEOUT_MS);
                        xSemaphoreTakeRecursive(client->lock, portMAX_DELAY);  // Re-acquire client->lock before break
                        break;
                    }

                    // Re-acquire client->lock to check state
                    xSemaphoreTakeRecursive(client->lock, portMAX_DELAY);

                    // Another thread may have closed it while we didn't hold client->lock
                    if (client->state != WEBSOCKET_STATE_CONNECTED || client->transport == NULL) {
                        ESP_LOGW(TAG, "Transport closed while preparing PING, skipping send");
                        xSemaphoreGiveRecursive(client->tx_lock);
                        break;
                    }
#endif
                    esp_transport_ws_send_raw(client->transport, WS_TRANSPORT_OPCODES_PING | WS_TRANSPORT_OPCODES_FIN, NULL, 0, client->config->network_timeout_ms);
#ifdef CONFIG_TF_WS_CLIENT_SEPARATE_TX_LOCK
                    xSemaphoreGiveRecursive(client->tx_lock);
#endif
                    if (!client->wait_for_pong_resp && client->config->pingpong_timeout_sec) {
                        client->pingpong_tick_ms = _tick_get_ms();
                        client->wait_for_pong_resp = true;
                    }
                }

                if (_tick_get_ms() - client->pingpong_tick_ms > client->config->pingpong_timeout_sec * 1000) {
                    if (client->wait_for_pong_resp) {
                        tf_websocket_client_error(client, "Error, no PONG received for more than %d seconds after PING", client->config->pingpong_timeout_sec);
                        tf_websocket_client_abort_connection(client, WEBSOCKET_ERROR_TYPE_PONG_TIMEOUT);
                        break;
                    }
                }
            }
            break;
        case WEBSOCKET_STATE_WAIT_TIMEOUT:

            if (_tick_get_ms() - client->reconnect_tick_ms > client->wait_timeout_ms) {
                client->state = WEBSOCKET_STATE_INIT;
                client->reconnect_tick_ms = _tick_get_ms();
                ESP_LOGD(TAG, "Reconnecting...");
            }
            break;
        case WEBSOCKET_STATE_CLOSING:
            // if closing not initiated by the client echo the close message back
            if ((CLOSE_FRAME_SENT_BIT & xEventGroupGetBits(client->status_bits)) == 0) {
                ESP_LOGD(TAG, "Closing initiated by the server, sending close frame");
#ifdef CONFIG_TF_WS_CLIENT_SEPARATE_TX_LOCK
                // Release client->lock first to avoid deadlock with send error path
                xSemaphoreGiveRecursive(client->lock);

                // Now acquire tx_lock with timeout (consistent with PONG/PING handling)
                if (xSemaphoreTakeRecursive(client->tx_lock, WEBSOCKET_TX_LOCK_TIMEOUT_MS) != pdPASS) {
                    ESP_LOGE(TAG, "Could not lock ws-client within %d timeout for CLOSE", WEBSOCKET_TX_LOCK_TIMEOUT_MS);
                    xSemaphoreTakeRecursive(client->lock, portMAX_DELAY);  // Re-acquire client->lock before break
                    break;
                }

                // Re-acquire client->lock to check state
                xSemaphoreTakeRecursive(client->lock, portMAX_DELAY);

                // Another thread may have closed it while we didn't hold client->lock
                if (client->state != WEBSOCKET_STATE_CLOSING || client->transport == NULL) {
                    ESP_LOGW(TAG, "Transport closed while preparing CLOSE frame, skipping send");
                    xSemaphoreGiveRecursive(client->tx_lock);
                    break;
                }
#endif
                esp_transport_ws_send_raw(client->transport, WS_TRANSPORT_OPCODES_CLOSE | WS_TRANSPORT_OPCODES_FIN, NULL, 0, client->config->network_timeout_ms);
#ifdef CONFIG_TF_WS_CLIENT_SEPARATE_TX_LOCK
                xSemaphoreGiveRecursive(client->tx_lock);
#endif
                xEventGroupSetBits(client->status_bits, CLOSE_FRAME_SENT_BIT);
            }
            break;
        default:
            ESP_LOGD(TAG, "Client run iteration in a default state: %d", client->state);
            break;
        }
        xSemaphoreGiveRecursive(client->lock);
        if (WEBSOCKET_STATE_CONNECTED == client->state) {
            read_select = esp_transport_poll_read(client->transport, 1000); //Poll every 1000ms
            if (read_select < 0) {
                xSemaphoreTakeRecursive(client->lock, lock_timeout);
                esp_tls_error_handle_t error_handle = esp_transport_get_error_handle(client->transport);
                if (error_handle) {
                    const char *error_name = esp_err_to_name(error_handle->last_error);
                    tf_websocket_client_error(client, "esp_transport_poll_read() returned %d, transport_error=%s, tls_error_code=%i, tls_flags=%i, errno=%d",
                                               read_select, error_name, error_handle->esp_tls_error_code,
                                               error_handle->esp_tls_flags, errno);
                } else {
                    tf_websocket_client_error(client, "esp_transport_poll_read() returned %d, errno=%d", read_select, errno);
                }
                tf_websocket_client_abort_connection(client, WEBSOCKET_ERROR_TYPE_TCP_TRANSPORT);
                xSemaphoreGiveRecursive(client->lock);
            } else if (read_select > 0) {
                xSemaphoreTakeRecursive(client->lock, lock_timeout);
                if (tf_websocket_client_recv(client) == ESP_FAIL) {
                    ESP_LOGE(TAG, "Error receive data");
                    tf_websocket_client_abort_connection(client, WEBSOCKET_ERROR_TYPE_TCP_TRANSPORT);
                }
                xSemaphoreGiveRecursive(client->lock);
            } else {
                ESP_LOGV(TAG, "Read poll timeout: skipping esp_transport_poll_read().");
            }
        } else if (WEBSOCKET_STATE_WAIT_TIMEOUT == client->state) {
            // waiting for reconnection or a request to stop the client...
            xEventGroupWaitBits(client->status_bits, REQUESTED_STOP_BIT, false, true, client->wait_timeout_ms / 2 / portTICK_PERIOD_MS);
        } else if (WEBSOCKET_STATE_CLOSING == client->state &&
                   (CLOSE_FRAME_SENT_BIT & xEventGroupGetBits(client->status_bits))) {
            ESP_LOGD(TAG, " Waiting for TCP connection to be closed by the server");
            int ret = esp_transport_ws_poll_connection_closed(client->transport, 1000);
            if (ret == 0) {
                ESP_LOGW(TAG, "Did not get TCP close within expected delay");

