Tinkerforge/esp32-firmware/software/src/tools/tf_websocket_client.c
            } else if (ret < 0) {
                ESP_LOGW(TAG, "Connection terminated while waiting for clean TCP close");
            }
            if (client->config->close_reconnect && xSemaphoreTakeRecursive(client->lock, lock_timeout) == pdPASS) {
                client->state = WEBSOCKET_STATE_WAIT_TIMEOUT;
                client->error_handle.error_type = WEBSOCKET_ERROR_TYPE_SERVER_CLOSE;
                esp_transport_close(client->transport);
                tf_websocket_client_dispatch_event(client, WEBSOCKET_EVENT_CLOSED, NULL, 0);
                client->reconnect_tick_ms = _tick_get_ms();
                ESP_LOGI(TAG, "Reconnect after %d ms", client->wait_timeout_ms);
                xEventGroupClearBits(client->status_bits, STOPPED_BIT | CLOSE_FRAME_SENT_BIT);
                xSemaphoreGiveRecursive(client->lock);
            } else {
                client->run = false;
                client->state = WEBSOCKET_STATE_UNKNOW;
                tf_websocket_client_dispatch_event(client, WEBSOCKET_EVENT_CLOSED, NULL, 0);
                break;
            }
        }
    }

    tf_websocket_client_dispatch_event(client, WEBSOCKET_EVENT_FINISH, NULL, 0);
    esp_transport_close(client->transport);
    client->state = WEBSOCKET_STATE_UNKNOW;
    if (client->selected_for_destroying == true) {
        destroy_and_free_resources(client);
    } else {
        xEventGroupSetBits(client->status_bits, STOPPED_BIT);
    }
    vTaskDelete(NULL);
}

esp_err_t tf_websocket_client_start(tf_websocket_client_handle_t client)
{
    if (client == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (client->state >= WEBSOCKET_STATE_INIT) {
        ESP_LOGE(TAG, "The client has started");
        return ESP_FAIL;
    }

    client->transport = client->config->ext_transport;
    if (!client->transport) {
        if (tf_websocket_client_create_transport(client) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to create websocket transport");
            return ESP_FAIL;
        }
    }

    if (xTaskCreatePinnedToCore(tf_websocket_client_task, client->config->task_name ? client->config->task_name : "websocket_task",
                                client->config->task_stack, client, client->config->task_prio, &client->task_handle, client->config->task_core_id) != pdTRUE) {
        ESP_LOGE(TAG, "Error create websocket task");
        return ESP_FAIL;
    }
    xEventGroupClearBits(client->status_bits, STOPPED_BIT | CLOSE_FRAME_SENT_BIT | REQUESTED_STOP_BIT);
    ESP_LOGI(TAG, "Started");
    return ESP_OK;
}

esp_err_t tf_websocket_client_stop(tf_websocket_client_handle_t client)
{
    if (client == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    if (xEventGroupGetBits(client->status_bits) & STOPPED_BIT) {
        ESP_LOGW(TAG, "Client was not started");
        return ESP_FAIL;
    }

    return stop_wait_task(client);
}

static int tf_websocket_client_send_close(tf_websocket_client_handle_t client, int code, const char *additional_data, int total_len, TickType_t timeout)
{
    uint8_t *close_status_data = NULL;
    // RFC6455#section-5.5.1: The Close frame MAY contain a body (indicated by total_len >= 2)
    if (total_len >= 2) {
        close_status_data = calloc(1, total_len);
        ESP_WS_CLIENT_MEM_CHECK(TAG, close_status_data, return -1);
        // RFC6455#section-5.5.1: The first two bytes of the body MUST be a 2-byte representing a status
        uint16_t *code_network_order = (uint16_t *) close_status_data;
        *code_network_order = htons(code);
        memcpy(close_status_data + 2, additional_data, total_len - 2);
    }
    int ret = tf_websocket_client_send_with_opcode(client, WS_TRANSPORT_OPCODES_CLOSE, close_status_data, total_len, timeout);
    free(close_status_data);
    return ret;
}


static esp_err_t tf_websocket_client_close_with_optional_body(tf_websocket_client_handle_t client, bool send_body, int code, const char *data, int len, TickType_t timeout)
{
    if (client == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!client->run) {
        ESP_LOGW(TAG, "Client was not started");
        return ESP_FAIL;
    }

    /* A running client cannot be stopped from the websocket task/event handler */
    TaskHandle_t running_task = xTaskGetCurrentTaskHandle();
    if (running_task == client->task_handle) {
        ESP_LOGE(TAG, "Client cannot be stopped from websocket task");
        return ESP_FAIL;
    }

    if (send_body) {
        tf_websocket_client_send_close(client, code, data, len + 2, portMAX_DELAY); // len + 2 -> always sending the code
    } else {
        tf_websocket_client_send_close(client, 0, NULL, 0, portMAX_DELAY); // only opcode frame
    }

    // Set closing bit to prevent from sending PING frames while connected
    xEventGroupSetBits(client->status_bits, CLOSE_FRAME_SENT_BIT);

    if (STOPPED_BIT & xEventGroupWaitBits(client->status_bits, STOPPED_BIT, false, true, timeout)) {
        return ESP_OK;
    }

    // If could not close gracefully within timeout, stop the client and disconnect
    client->run = false;
    xEventGroupSetBits(client->status_bits, REQUESTED_STOP_BIT);
    xEventGroupWaitBits(client->status_bits, STOPPED_BIT, false, true, portMAX_DELAY);
    client->state = WEBSOCKET_STATE_UNKNOW;
    return ESP_OK;
}

esp_err_t tf_websocket_client_close_with_code(tf_websocket_client_handle_t client, int code, const char *data, int len, TickType_t timeout)
{
    return tf_websocket_client_close_with_optional_body(client, true, code, data, len, timeout);
}

esp_err_t tf_websocket_client_close(tf_websocket_client_handle_t client, TickType_t timeout)
{
    return tf_websocket_client_close_with_optional_body(client, false, 0, NULL, 0, timeout);
}

int tf_websocket_client_send_text(tf_websocket_client_handle_t client, const char *data, int len, TickType_t timeout)
{
    return tf_websocket_client_send_with_opcode(client, WS_TRANSPORT_OPCODES_TEXT, (const uint8_t *)data, len, timeout);
}

int tf_websocket_client_send_text_partial(tf_websocket_client_handle_t client, const char *data, int len, TickType_t timeout)
{
    return tf_websocket_client_send_with_exact_opcode(client, WS_TRANSPORT_OPCODES_TEXT, (const uint8_t *)data, len, timeout);
}

int tf_websocket_client_send_cont_msg(tf_websocket_client_handle_t client, const char *data, int len, TickType_t timeout)
{
    return tf_websocket_client_send_with_exact_opcode(client, WS_TRANSPORT_OPCODES_CONT, (const uint8_t *)data, len, timeout);
}

int tf_websocket_client_send_bin(tf_websocket_client_handle_t client, const char *data, int len, TickType_t timeout)
{
    return tf_websocket_client_send_with_opcode(client, WS_TRANSPORT_OPCODES_BINARY, (const uint8_t *)data, len, timeout);
}

int tf_websocket_client_send_bin_partial(tf_websocket_client_handle_t client, const char *data, int len, TickType_t timeout)
{
    return tf_websocket_client_send_with_exact_opcode(client, WS_TRANSPORT_OPCODES_BINARY, (const uint8_t *)data, len, timeout);
}

int tf_websocket_client_send_fin(tf_websocket_client_handle_t client, TickType_t timeout)
{
    return tf_websocket_client_send_with_exact_opcode(client, WS_TRANSPORT_OPCODES_FIN, NULL, 0, timeout);
}

int tf_websocket_client_send_ping(tf_websocket_client_handle_t client, TickType_t timeout)
{
    return tf_websocket_client_send_with_exact_opcode(client, WS_TRANSPORT_OPCODES_PING | WS_TRANSPORT_OPCODES_FIN, NULL, 0, timeout);
}

